app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      begin
        @songs = Artist.find(params[:artist_id]).songs
      rescue ActiveRecord::RecordNotFound
        redirect_to artists_path, alert: "Artist not found."
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 3]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      begin
        @song = Song.find(params[:id])
      rescue ActiveRecord::RecordNotFound
        redirect_to artist_songs_path(Artist.find(params[:artist_id])), alert: "Song not found."
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]